Project/Toir/src/Documents/торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов/торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов</name>
  <registerRecords>InformationRegister.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл</registerRecords>
  <registerRecords>InformationRegister.торо_КоэффициентыПереводаБазовыхЦенВТекущие</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыДокументаВводНачДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подрядчики</name>
    <attributes>
      <name>Подрядчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыПеревода</name>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Направления</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыПереводаСписковОбъектов</name>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>СписокОбъектов</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_КоэффициентыПереводаБазовыхЦенВТекущие/торо_КоэффициентыПереводаБазовыхЦенВТекущие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КоэффициентыПереводаБазовыхЦенВТекущие</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПоказательКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направления</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификаторРемонтов</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл/торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПоказательКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификаторРемонтов</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыДокументаВводНачДанных/торо_ВидыДокументаВводНачДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументаВводНачДанных</name>
  <enumValues>
    <name>ПоОбъектуРемонта</name>
  </enumValues>
  <enumValues>
    <name>ПоСпискуОбъектовРемонта</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		Если КоэффициентыПеревода.Количество() = 0 Тогда
			ТекстСообщения = НСтр("es='En el documento no es rellenado ni una parte tabular. ¡La realización es imposible!';ru='В документе не заполнена ни одна табличная часть. Проведение невозможно!';en='No tabular part is filled in the document. Conducting is impossible!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	Иначе
		Если КоэффициентыПереводаСписковОбъектов.Количество() = 0 Тогда
			ТекстСообщения = НСтр("es='En el documento no es rellenado ni una parte tabular. ¡La realización es imposible!';ru='В документе не заполнена ни одна табличная часть. Проведение невозможно!';en='No tabular part is filled in the document. Conducting is impossible!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("es='¡No заполненно el significado escardando ""la Organización""!';ru='Не заполненно значение поля ""Организация""!';en='The value of the field ""Organization"" is not filled!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		
		// регистр торо_КоэффициентыПереводаБазовыхЦенВТекущие
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Записывать = Истина;
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Очистить();
		
		Для Каждого ТекСтрокаКоэффициентыПеревода Из КоэффициентыПеревода Цикл
			Движение = Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Добавить();
			Движение.Период = Дата;
			Движение.Организация = ТекСтрокаКоэффициентыПеревода.Организация;
			Движение.Подразделение = ТекСтрокаКоэффициентыПеревода.Подразделение;
			Движение.Направления = ТекСтрокаКоэффициентыПеревода.Направления;
			Движение.ОбъектРемонта = ТекСтрокаКоэффициентыПеревода.ОбъектРемонта;
			Движение.КлассификаторРемонтов = ТекСтрокаКоэффициентыПеревода.КлассификаторРемонтов;
			Движение.Коэффициент = ТекСтрокаКоэффициентыПеревода.Коэффициент;
			Движение.ПоказательКоэффициента = ТекСтрокаКоэффициентыПеревода.ПоказательКоэффициента;
		КонецЦикла;
	Иначе 
		
		// регистр торо_КоэффициентыПереводаБазовыхЦенВТекущие
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Записывать = Истина;
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Очистить();

		Для Каждого ТекСтрокаКоэффициентыПеревода Из КоэффициентыПереводаСписковОбъектов Цикл
			Движение = Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Добавить();
			Движение.Период = Дата;
			Движение.СписокОбъектов = ТекСтрокаКоэффициентыПеревода.СписокОбъектов;
			Движение.КлассификаторРемонтов = ТекСтрокаКоэффициентыПеревода.КлассификаторРемонтов;
			Движение.Коэффициент = ТекСтрокаКоэффициентыПеревода.Коэффициент;
			Движение.ПоказательКоэффициента = ТекСтрокаКоэффициентыПеревода.ПоказательКоэффициента;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
